_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
=================================================================
Total params: 8,396,802
Trainable params: 8,396,802
Non-trainable params: 0
_________________________________________________________________
[0.20446197793370399, 0.96508847441415591]['loss', 'acc']
acc: 96.51%             precision    recall  f1-score   support

        ham       0.85      0.84      0.84       470
       spam       0.98      0.98      0.98      3712

avg / total       0.96      0.97      0.96      4182
