_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
=================================================================
Total params: 8,396,802
Trainable params: 8,396,802
Non-trainable params: 0
_________________________________________________________________
[0.11172592251322692, 0.98580441640378547]['loss', 'acc']
acc: 98.58%             precision    recall  f1-score   support

        ham       0.98      0.98      0.98       502
       spam       0.99      0.99      0.99       766

avg / total       0.99      0.99      0.99      1268
