_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
=================================================================
Total params: 8,396,802
Trainable params: 8,396,802
Non-trainable params: 0
_________________________________________________________________
[0.22844618429188701, 0.96481387047424783]['loss', 'acc']
acc: 96.48%             precision    recall  f1-score   support

        ham       0.86      0.86      0.86       503
       spam       0.98      0.98      0.98      3419

avg / total       0.96      0.96      0.96      3922
