_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
=================================================================
Total params: 8,396,802
Trainable params: 8,396,802
Non-trainable params: 0
_________________________________________________________________
[0.27000686186677325, 0.95049190733100608]['loss', 'acc']
acc: 95.05%             precision    recall  f1-score   support

        ham       0.88      0.79      0.83       494
       spam       0.96      0.98      0.97      2657

avg / total       0.95      0.95      0.95      3151
