_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.17978798180932709, 0.94411046402404664]['loss', 'acc']
acc: 94.41%             precision    recall  f1-score   support

        ham       0.92      0.95      0.93      3481
       spam       0.98      0.94      0.96      7049
         ad       0.35      0.91      0.51       116

avg / total       0.96      0.94      0.95     10646
