_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.2480292390593711, 0.91727941176470584]['loss', 'acc']
acc: 91.73%             precision    recall  f1-score   support

        ham       0.92      0.91      0.91       864
       spam       0.98      0.92      0.95      1811
         ad       0.27      0.96      0.42        45

avg / total       0.95      0.92      0.93      2720
