_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.24291534249987859, 0.90996270720858363]['loss', 'acc']
acc: 91.00%             precision    recall  f1-score   support

        ham       0.95      0.85      0.90       545
       spam       0.97      0.93      0.95      1313
         ad       0.15      1.00      0.26        19

avg / total       0.96      0.91      0.93      1877
