_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.30677284187336634, 0.91312931826648924]['loss', 'acc']
acc: 91.31%             precision    recall  f1-score   support

        ham       0.92      0.89      0.91      1026
       spam       0.97      0.92      0.95      1929
         ad       0.39      0.96      0.55        84

avg / total       0.94      0.91      0.92      3039
