_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.31814019114554526, 0.91513897130504862]['loss', 'acc']
acc: 91.51%             precision    recall  f1-score   support

        ham       0.88      0.92      0.90      1123
       spam       0.96      0.91      0.94      2116
         ad       0.66      0.86      0.75       143

avg / total       0.92      0.92      0.92      3382
