_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.58607371552696597, 0.8870664739884393]['loss', 'acc']
acc: 88.71%             precision    recall  f1-score   support

        ham       0.89      0.84      0.87      4703
       spam       0.89      0.93      0.91      7813
         ad       0.83      0.80      0.82      1324

avg / total       0.89      0.89      0.89     13840
