_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.38464272520154891, 0.90576116018102448]['loss', 'acc']
acc: 90.58%             precision    recall  f1-score   support

        ham       0.92      0.89      0.90      1772
       spam       0.96      0.92      0.94      3215
         ad       0.51      0.88      0.64       255

avg / total       0.92      0.91      0.91      5242
