_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.25551326509843547, 0.93026359736780184]['loss', 'acc']
acc: 93.03%             precision    recall  f1-score   support

        ham       0.98      0.89      0.93       930
       spam       0.96      0.95      0.95      1983
         ad       0.42      0.96      0.59        84

avg / total       0.95      0.93      0.94      2997
