_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.56639424995061471, 0.87911636692613981]['loss', 'acc']
acc: 87.91%             precision    recall  f1-score   support

        ham       0.81      0.88      0.84      3772
       spam       0.92      0.89      0.91      7363
         ad       0.87      0.79      0.83      1042

avg / total       0.88      0.88      0.88     12177
