_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.27453121654246576, 0.90662139212268855]['loss', 'acc']
acc: 90.66%             precision    recall  f1-score   support

        ham       0.94      0.86      0.90      1195
       spam       0.95      0.93      0.94      2228
         ad       0.39      0.94      0.55       111

avg / total       0.93      0.91      0.91      3534
