_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.15794752918741831, 0.94911968987239537]['loss', 'acc']
acc: 94.91%             precision    recall  f1-score   support

        ham       0.92      0.96      0.94      1907
       spam       0.99      0.95      0.97      4273
         ad       0.10      1.00      0.18        11

avg / total       0.96      0.95      0.96      6191
