_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.13883338901214301, 0.9489061397318278]['loss', 'acc']
acc: 94.89%             precision    recall  f1-score   support

        ham       0.89      0.98      0.93      2423
       spam       0.99      0.93      0.96      4589
         ad       0.83      0.95      0.88        73

avg / total       0.95      0.95      0.95      7085
