_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.25374211196408442, 0.92945544593798446]['loss', 'acc']
acc: 92.95%             precision    recall  f1-score   support

        ham       0.94      0.91      0.93       761
       spam       0.97      0.94      0.95      1594
         ad       0.45      0.96      0.61        69

avg / total       0.95      0.93      0.93      2424
