_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.20108081429746694, 0.93696651373423012]['loss', 'acc']
acc: 93.70%             precision    recall  f1-score   support

        ham       0.95      0.93      0.94       496
       spam       0.98      0.94      0.96      1010
         ad       0.27      1.00      0.42        17

avg / total       0.96      0.94      0.94      1523
