_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.2630157803355071, 0.94313128950610925]['loss', 'acc']
acc: 94.31%             precision    recall  f1-score   support

        ham       0.91      0.91      0.91      1293
       spam       0.95      0.96      0.96      2827
         ad       0.97      0.91      0.94       153

avg / total       0.94      0.94      0.94      4273
