_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.34726946927724461, 0.90295926201444332]['loss', 'acc']
acc: 90.30%             precision    recall  f1-score   support

        ham       0.92      0.88      0.90      1823
       spam       0.95      0.92      0.93      3099
         ad       0.52      0.86      0.65       282

avg / total       0.92      0.90      0.91      5204
