_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.23490318872026658, 0.92743644067796616]['loss', 'acc']
acc: 92.74%             precision    recall  f1-score   support

        ham       0.95      0.91      0.93       619
       spam       0.97      0.93      0.95      1241
         ad       0.29      1.00      0.45        28

avg / total       0.95      0.93      0.94      1888
