_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.5754892296212355, 0.87776062302423929]['loss', 'acc']
acc: 87.78%             precision    recall  f1-score   support

        ham       0.88      0.86      0.87      5179
       spam       0.91      0.90      0.91      8288
         ad       0.72      0.81      0.76      1430

avg / total       0.88      0.88      0.88     14897
