_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.22778186616209142, 0.91997116120839684]['loss', 'acc']
acc: 92.00%             precision    recall  f1-score   support

        ham       0.96      0.89      0.92       384
       spam       0.97      0.93      0.95       993
         ad       0.12      1.00      0.22        10

avg / total       0.96      0.92      0.94      1387
