_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.16876379521705065, 0.9381778752209049]['loss', 'acc']
acc: 93.82%             precision    recall  f1-score   support

        ham       0.95      0.91      0.93       274
       spam       0.97      0.95      0.96       639
         ad       0.26      1.00      0.42         9

avg / total       0.96      0.94      0.95       922
