_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.20727650556811311, 0.92196957304106009]['loss', 'acc']
acc: 92.20%             precision    recall  f1-score   support

        ham       0.94      0.92      0.93      6064
       spam       0.98      0.92      0.95     11828
         ad       0.34      0.95      0.50       447

avg / total       0.95      0.92      0.93     18339
