_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.38983841963317617, 0.90466408893185113]['loss', 'acc']
acc: 90.47%             precision    recall  f1-score   support

        ham       0.86      0.93      0.89      3125
       spam       0.94      0.90      0.92      4534
         ad       0.91      0.81      0.86       617

avg / total       0.91      0.90      0.90      8276
