_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.32867028207546434, 0.91437381415484753]['loss', 'acc']
acc: 91.44%             precision    recall  f1-score   support

        ham       0.93      0.89      0.91      1416
       spam       0.96      0.93      0.94      2624
         ad       0.49      0.90      0.63       176

avg / total       0.93      0.91      0.92      4216
