_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.40032961792568966, 0.8976465365179479]['loss', 'acc']
acc: 89.76%             precision    recall  f1-score   support

        ham       0.94      0.85      0.89      1584
       spam       0.93      0.93      0.93      2703
         ad       0.48      0.88      0.62       217

avg / total       0.92      0.90      0.90      4504
