_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.25276735215679469, 0.91563867891731365]['loss', 'acc']
acc: 91.56%             precision    recall  f1-score   support

        ham       0.95      0.88      0.92       808
       spam       0.97      0.93      0.95      1655
         ad       0.27      0.96      0.42        50

avg / total       0.95      0.92      0.93      2513
