_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.14242701651870876, 0.96507352941176472]['loss', 'acc']
acc: 96.51%             precision    recall  f1-score   support

        ham       0.90      0.98      0.94       154
       spam       0.99      0.96      0.98       388
         ad       1.00      1.00      1.00         2

avg / total       0.97      0.97      0.97       544
