_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.25316268604780945, 0.91621911929066024]['loss', 'acc']
acc: 91.62%             precision    recall  f1-score   support

        ham       0.93      0.91      0.92       552
       spam       0.98      0.92      0.95      1290
         ad       0.18      1.00      0.30        20

avg / total       0.96      0.92      0.93      1862
