_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.26356661869835962, 0.93310848814909075]['loss', 'acc']
acc: 93.31%             precision    recall  f1-score   support

        ham       0.88      0.94      0.91       506
       spam       0.97      0.93      0.95      1204
         ad       0.74      0.96      0.84        69

avg / total       0.94      0.93      0.93      1779
