_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.27228818724795084, 0.91263858138061149]['loss', 'acc']
acc: 91.26%             precision    recall  f1-score   support

        ham       0.96      0.87      0.91       710
       spam       0.97      0.93      0.95      1516
         ad       0.18      1.00      0.31        29

avg / total       0.96      0.91      0.93      2255
