_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.083352858963159832, 0.95578316262802898]['loss', 'acc']
acc: 95.58%             precision    recall  f1-score   support

        ham       0.89      0.98      0.94      1297
       spam       0.99      0.94      0.97      2703
         ad       1.00      1.00      1.00         3

avg / total       0.96      0.96      0.96      4003
