_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.3496928726140166, 0.9046728973076722]['loss', 'acc']
acc: 90.47%             precision    recall  f1-score   support

        ham       0.92      0.89      0.91      1355
       spam       0.97      0.91      0.94      2765
         ad       0.39      0.93      0.55       160

avg / total       0.93      0.90      0.91      4280
