_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.26878045709078546, 0.9096183207926859]['loss', 'acc']
acc: 90.96%             precision    recall  f1-score   support

        ham       0.91      0.89      0.90      1014
       spam       0.96      0.92      0.94      2174
         ad       0.38      0.95      0.55        87

avg / total       0.93      0.91      0.92      3275
