_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.40929562123865199, 0.88835018702302382]['loss', 'acc']
acc: 88.84%             precision    recall  f1-score   support

        ham       0.92      0.88      0.90      2649
       spam       0.94      0.89      0.92      4059
         ad       0.53      0.88      0.66       511

avg / total       0.91      0.89      0.89      7219
