_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.2010266881998192, 0.94542536278214917]['loss', 'acc']
acc: 94.54%             precision    recall  f1-score   support

        ham       0.97      0.93      0.95       391
       spam       0.98      0.95      0.96       843
         ad       0.24      1.00      0.39        12

avg / total       0.97      0.95      0.95      1246
