_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.5847219420986447, 0.89489627317789611]['loss', 'acc']
acc: 89.49%             precision    recall  f1-score   support

        ham       0.90      0.83      0.86      3347
       spam       0.90      0.94      0.92      6581
         ad       0.82      0.80      0.81       966

avg / total       0.89      0.89      0.89     10894
