_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.17335905980527472, 0.95351609115236846]['loss', 'acc']
acc: 95.35%             precision    recall  f1-score   support

        ham       0.89      0.96      0.93       224
       spam       0.99      0.95      0.97       612
         ad       0.38      1.00      0.55         3

avg / total       0.96      0.95      0.96       839
