_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.34319207306160615, 0.91449532028152891]['loss', 'acc']
acc: 91.45%             precision    recall  f1-score   support

        ham       0.94      0.86      0.90      1378
       spam       0.93      0.95      0.94      2395
         ad       0.65      0.84      0.74       180

avg / total       0.92      0.91      0.92      3953
