_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.24159813594173066, 0.92449664429530198]['loss', 'acc']
acc: 92.45%             precision    recall  f1-score   support

        ham       0.97      0.85      0.91       326
       spam       0.98      0.95      0.97       854
         ad       0.15      1.00      0.26        12

avg / total       0.97      0.92      0.94      1192
