_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.36031130318549348, 0.93178545707760307]['loss', 'acc']
acc: 93.18%             precision    recall  f1-score   support

        ham       0.96      0.87      0.91      1718
       spam       0.94      0.97      0.95      3609
         ad       0.72      0.89      0.79       229

avg / total       0.93      0.93      0.93      5556
