_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.39237723723118989, 0.90792189239225496]['loss', 'acc']
acc: 90.79%             precision    recall  f1-score   support

        ham       0.88      0.91      0.89      2248
       spam       0.95      0.91      0.93      3690
         ad       0.74      0.84      0.79       361

avg / total       0.91      0.91      0.91      6299
