_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.58015439618020537, 0.8673008510044643]['loss', 'acc']
acc: 86.73%             precision    recall  f1-score   support

        ham       0.83      0.88      0.85     40350
       spam       0.92      0.87      0.89     63476
         ad       0.74      0.82      0.78     10862

avg / total       0.87      0.87      0.87    114688
