_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.21278416082638738, 0.92429527131680511]['loss', 'acc']
acc: 92.43%             precision    recall  f1-score   support

        ham       0.93      0.91      0.92      5891
       spam       0.98      0.93      0.95     11292
         ad       0.29      0.96      0.45       306

avg / total       0.95      0.92      0.93     17489
