_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 6147      
=================================================================
Total params: 8,398,851
Trainable params: 8,398,851
Non-trainable params: 0
_________________________________________________________________
[0.31230648078718243, 0.91363124313812882]['loss', 'acc']
acc: 91.36%             precision    recall  f1-score   support

        ham       0.86      0.93      0.89       821
       spam       0.97      0.91      0.94      1750
         ad       0.61      0.88      0.72        92

avg / total       0.92      0.91      0.92      2663
