_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
=================================================================
Total params: 8,396,802
Trainable params: 8,396,802
Non-trainable params: 0
_________________________________________________________________
[0.080913019201922232, 0.98153034300791553]['loss', 'acc']
acc: 98.15%             precision    recall  f1-score   support

        ham       0.99      0.98      0.99       483
       spam       0.97      0.98      0.97       275

avg / total       0.98      0.98      0.98       758
