_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
=================================================================
Total params: 8,396,802
Trainable params: 8,396,802
Non-trainable params: 0
_________________________________________________________________
[0.085927210862255646, 0.98680738786279687]['loss', 'acc']
acc: 98.68%             precision    recall  f1-score   support

        ham       1.00      0.98      0.99       483
       spam       0.97      0.99      0.98       275

avg / total       0.99      0.99      0.99       758
